<template>
张倩, 张盛, 林孝康,等. 物联网:发展、应用及关键技术[J]. 电讯技术, 2012, 52(12):8.
孙鹏, 王耀辉, 陈超. 物联网核心技术与应用场景[J]. 通信技术, 2011, 44(5):3.
郭小丹. 基于物联网技术的高校实验室安防监测系统[J]. 实验室研究与探索, 2014, 33(4):5.
寇亮. 物联网感知层安全防御技术研究[D].哈尔滨工程大学,2019.
闫亚玲, 李博, 刘伟杰. 基于ZigBee的实验室防火远程监控系统设计[J]. 实验室研究与探索, 2019, 38(5):4.
童英华. 物联网监测系统的可靠性分析及优化[D].青海师范大学,2020.
郁莹珺. 基于物联网技术的温室小气候分析及其应用研究[D].浙江农林大学,2018.
安臣伟. 基于物联网的家庭环境监测系统[D].内蒙古大学,2019.
聂源基. 基于Arduino和LabVIEW的田间环境监测系统设计与实现[D].济南大学,2020.
张铁峰. 化学实验室有毒有害气体微型净化装置[J]. 农村青少年科学探究, 2020(3):1.谢东坡. 室内环境监测与舒适度评判系统研究[D]. 重庆理工大学.
王瑜. 基于WSN纵向通风猪舍温热环境监测及CFD模型的研究[D].华中农业大学,2020.
黄梓莘,单鸿涛,周婧怡等.基于ZigBee的校园宿舍环境安全监测系统[J].测控技术,2019,38(03):42-46.
黄梓莘,单鸿涛,周婧怡等.基于ZigBee的校园宿舍环境安全监测系统[J].测控技术,2019,38(03):42-46.
靳涛.基于Zigbee的文物古建筑火灾报警系统设计与实现[J].科技创新导报,2018,15(10):182+184.
肖遥. 基于Arduino的机电控制CAI系统开发[D].浙江理工大学,2016.
王志花. 面向移动终端的餐饮管理系统的设计与实现[D].河北科技大学,2017.
刘博文. 保障房管理信息系统的准入与退出功能分析[D].兰州交通大学,2019.
闫亚玲, 李博, 刘伟杰. 基于ZigBee的实验室防火远程监控系统设计[J]. 实验室研究与探索, 2019, 38(5):4.
朱韶红, 王玉泉. 物联网技术在智慧校园建设中的应用[J]. 中国科技信息, 2013(19):2.
陈仲华. IPv6技术在物联网中的应用[J]. 电信科学, 2010(04):16-19.
于修和, 王冲. 基于移动通信网络的物联网应用研究[J]. 通信管理与技术, 2010(3):3.
秦晓华, 段侪杰, 袁克虹,等. 一种老年人移动健康监护系统的研究[J]. 中国医学物理学杂志, 2011(1):4.
邹焱飚, 谢存禧. 基于家庭的远程健康监护系统进展[J]. 计算机工程与应用, 2005, 41(10):5.
尹亮. 物联网技术的研究[J]. 企业导报, 2011(7):1.
李文韬. 基于单片机的智能家居系统设计[J]. 电子制作, 2014(17):2.
薛毛毛, 赖际亮, 崔宁. 基于微信和Arduino家用物联网系统开发[J]. 物联网技术, 2017, 7(4):4.
关庆余. 基于MQTT协议的移动社交网络客户端的设计与实现[D]. 中国科学院研究生院(沈阳计算技术研究所).
任亨. 基于MQTT协议的消息推送集群系统的设计与实现[D]. 中国科学院研究生院（沈阳计算技术研究所）2014.
马跃, 孙翱, 贾军营,等. MQTT协议在移动互联网即时通信中的应用[J]. 计算机系统应用, 2016(3):7.
任亨, 马跃, 杨海波,等. 基于MQTT协议的消息推送服务器[J]. 计算机系统应用, 2014.
韦宇, 陈志刚. 基于SMTP的邮件发送程序设计[J]. 电脑开发与应用, 2000, 13(10):3.
刘宴兵, 李春. 使用SMTP实现邮件发送设计[J]. 计算机工程与应用, 2002, 38(8):3.
朱健, 卢秉亮, 王盛明,等. 邮件发送客户端SMTP协议的实现[J]. 微处理机, 2008(01):100-102.
丁岳伟. 基于SMTP协议电子邮件的还原[J]. 小型微型计算机系统, 2002, 23(3):4.
马沙沙.基于Arduino&Android的烟雾报警系统[D].长安大学.
蔡睿妍.Arduino的原理及应用[J].电子设计工程,2012.吴勇,张建虎,彭炜,等.基于Arduino的仓库温湿度检测器的设计[J].仪表技术, 2016(11):4.
侯琳,韩晨昱,林海涛.基于Arduino的环境数据采集系统的应用[J].科学技术创新, 2017(30):2.
姚菁,狄琤,刘贵云,等.一种基于Arduino的数据采集系统:CN207626606U[P].2018.
林倩.DHT11数字温湿度传感器通信协议的IO模拟[J].信息通信,2017(1):2.
王登宏,厉佳男,贺雪辉,等.基于Arduino的手机同步显示温湿度检测系统的设计与实现[J].工业控制计算机,2016.
杨静. 基于Arduino和App Inventor2的空气温湿度检测系统设计[J]. 电子技术与软件工程, 2018(21):2.
张群强,赵巧妮.基于MQ-2型传感器火灾报警系统的设计[J].价值工程,2015, 34(13):3.
陈惠玲,刘佳文, 秦子敬,等.基于Arduino和IOT的家庭消防逃生报警系统[J].计算机技术与发展, 2020, 30(5):6.
周旋, 谌建飞, 赵丹,等. 基于ZigBee的实验室远程监测系统设计[J]. 中国教育信息化, 2017(4):5.
</template>